ARMmbed/mbed-os/targets/TARGET_Infineon/XMCLib/inc/xmc4_ccu8_map.h
#if (UC_DEVICE == XMC4700) && (UC_PACKAGE == LQFP144)
#define CCU80_IN0_CCU40_SR3                	10
#define CCU80_IN0_CCU80_ST0                	12
#define CCU80_IN0_CCU80_ST1                	13
#define CCU80_IN0_CCU80_ST2                	14
#define CCU80_IN0_CCU80_ST3                	15
#define CCU80_IN0_CCU81_SR3                	11
#define CCU80_IN0_ERU1_PDOUT0              	9
#define CCU80_IN0_P0_7                     	0
#define CCU80_IN0_P3_2                     	2
#define CCU80_IN0_P3_4                     	1
#define CCU80_IN0_POSIF0_OUT2              	3
#define CCU80_IN0_POSIF0_OUT5              	4
#define CCU80_IN0_SCU_ERU1_IOUT0           	6
#define CCU80_IN0_SCU_GSC80                	7
#define CCU80_IN0_VADC0_G0BFL0             	8
#define CCU80_IN0_VADC0_G0SR3              	5
#define CCU80_IN1_CCU41_SR3                	10
#define CCU80_IN1_CCU80_ST0                	12
#define CCU80_IN1_CCU80_ST1                	13
#define CCU80_IN1_CCU80_ST2                	14
#define CCU80_IN1_CCU80_ST3                	15
#define CCU80_IN1_CCU81_SR3                	11
#define CCU80_IN1_ERU1_PDOUT0              	9
#define CCU80_IN1_ERU1_PDOUT1              	5
#define CCU80_IN1_P0_7                     	0
#define CCU80_IN1_P0_8                     	1
#define CCU80_IN1_P3_1                     	2
#define CCU80_IN1_POSIF0_OUT2              	3
#define CCU80_IN1_POSIF0_OUT5              	4
#define CCU80_IN1_SCU_ERU1_IOUT1           	6
#define CCU80_IN1_SCU_GSC80                	7
#define CCU80_IN1_VADC0_G0BFL1             	8
#define CCU80_IN2_CCU42_SR3                	10
#define CCU80_IN2_CCU80_ST0                	12
#define CCU80_IN2_CCU80_ST1                	13
#define CCU80_IN2_CCU80_ST2                	14
#define CCU80_IN2_CCU80_ST3                	15
#define CCU80_IN2_CCU81_SR3                	11
#define CCU80_IN2_ERU1_PDOUT0              	9
#define CCU80_IN2_ERU1_PDOUT2              	5
#define CCU80_IN2_P0_6                     	1
#define CCU80_IN2_P0_7                     	0
#define CCU80_IN2_P3_0                     	2
#define CCU80_IN2_POSIF0_OUT2              	3
#define CCU80_IN2_POSIF0_OUT5              	4
#define CCU80_IN2_SCU_ERU1_IOUT2           	6
#define CCU80_IN2_SCU_GSC80                	7
#define CCU80_IN2_VADC0_G0BFL2             	8
#define CCU80_IN3_CCU43_SR3                	10
#define CCU80_IN3_CCU80_ST0                	12
#define CCU80_IN3_CCU80_ST1                	13
#define CCU80_IN3_CCU80_ST2                	14
#define CCU80_IN3_CCU80_ST3                	15
#define CCU80_IN3_CCU81_SR3                	11
#define CCU80_IN3_ERU1_PDOUT0              	9
#define CCU80_IN3_ERU1_PDOUT3              	5
#define CCU80_IN3_P0_7                     	0
#define CCU80_IN3_P3_13                    	2
#define CCU80_IN3_P3_3                     	1
#define CCU80_IN3_POSIF0_OUT2              	3
#define CCU80_IN3_POSIF0_OUT5              	4
#define CCU80_IN3_SCU_ERU1_IOUT3           	6
#define CCU80_IN3_SCU_GSC80                	7
#define CCU80_IN3_VADC0_G0BFL3             	8
#define CCU81_IN0_CCU40_SR3                	10
#define CCU81_IN0_CCU80_SR3                	11
#define CCU81_IN0_CCU81_ST0                	12
#define CCU81_IN0_CCU81_ST1                	13
#define CCU81_IN0_CCU81_ST2                	14
#define CCU81_IN0_CCU81_ST3                	15
#define CCU81_IN0_ERU1_PDOUT0              	5
#define CCU81_IN0_ERU1_PDOUT1              	8
#define CCU81_IN0_P3_0                     	2
#define CCU81_IN0_P5_0                     	0
#define CCU81_IN0_P5_1                     	1
#define CCU81_IN0_POSIF1_OUT2              	3
#define CCU81_IN0_POSIF1_OUT5              	4
#define CCU81_IN0_SCU_ERU1_IOUT0           	6
#define CCU81_IN0_SCU_GSC81                	7
#define CCU81_IN0_VADC0_G0SR3              	9
#define CCU81_IN1_CCU41_SR3                	10
#define CCU81_IN1_CCU80_SR3                	11
#define CCU81_IN1_CCU81_ST0                	12
#define CCU81_IN1_CCU81_ST1                	13
#define CCU81_IN1_CCU81_ST2                	14
#define CCU81_IN1_CCU81_ST3                	15
#define CCU81_IN1_ERU1_PDOUT0              	8
#define CCU81_IN1_P3_13                    	2
#define CCU81_IN1_P5_0                     	0
#define CCU81_IN1_P5_2                     	1
#define CCU81_IN1_POSIF1_OUT2              	3
#define CCU81_IN1_POSIF1_OUT5              	4
#define CCU81_IN1_SCU_ERU1_IOUT1           	6
#define CCU81_IN1_SCU_GSC81                	7
#define CCU81_IN1_VADC0_G1SR3              	9
#define CCU81_IN2_CCU42_SR3                	10
#define CCU81_IN2_CCU80_SR3                	11
#define CCU81_IN2_CCU81_ST0                	12
#define CCU81_IN2_CCU81_ST1                	13
#define CCU81_IN2_CCU81_ST2                	14
#define CCU81_IN2_CCU81_ST3                	15
#define CCU81_IN2_ERU1_PDOUT1              	8
#define CCU81_IN2_ERU1_PDOUT2              	5
#define CCU81_IN2_P3_12                    	2
#define CCU81_IN2_P5_0                     	0
#define CCU81_IN2_P5_3                     	1
#define CCU81_IN2_POSIF1_OUT2              	3
#define CCU81_IN2_POSIF1_OUT5              	4
#define CCU81_IN2_SCU_ERU1_IOUT2           	6
#define CCU81_IN2_SCU_GSC81                	7
#define CCU81_IN2_VADC0_G2SR3              	9
#define CCU81_IN3_CCU43_SR3                	10
#define CCU81_IN3_CCU80_SR3                	11
#define CCU81_IN3_CCU81_ST0                	12
#define CCU81_IN3_CCU81_ST1                	13
#define CCU81_IN3_CCU81_ST2                	14
#define CCU81_IN3_CCU81_ST3                	15
#define CCU81_IN3_ERU1_PDOUT1              	8
#define CCU81_IN3_ERU1_PDOUT3              	5
#define CCU81_IN3_P3_11                    	2
#define CCU81_IN3_P5_0                     	0
#define CCU81_IN3_P5_4                     	1
#define CCU81_IN3_POSIF1_OUT2              	3
#define CCU81_IN3_POSIF1_OUT5              	4
#define CCU81_IN3_SCU_ERU1_IOUT3           	6
#define CCU81_IN3_SCU_GSC81                	7
#define CCU81_IN3_VADC0_G3SR3              	9
#endif


#if (UC_DEVICE == XMC4800) && (UC_PACKAGE == BGA196)
#define CCU80_IN0_CCU40_SR3                	10
#define CCU80_IN0_CCU80_ST0                	12
#define CCU80_IN0_CCU80_ST1                	13
#define CCU80_IN0_CCU80_ST2                	14
#define CCU80_IN0_CCU80_ST3                	15
#define CCU80_IN0_CCU81_SR3                	11
#define CCU80_IN0_ERU1_PDOUT0              	9
#define CCU80_IN0_P0_7                     	0
#define CCU80_IN0_P3_2                     	2
#define CCU80_IN0_P3_4                     	1
#define CCU80_IN0_POSIF0_OUT2              	3
#define CCU80_IN0_POSIF0_OUT5              	4
#define CCU80_IN0_SCU_ERU1_IOUT0           	6
#define CCU80_IN0_SCU_GSC80                	7
#define CCU80_IN0_VADC0_G0BFL0             	8
#define CCU80_IN0_VADC0_G0SR3              	5
#define CCU80_IN1_CCU41_SR3                	10
#define CCU80_IN1_CCU80_ST0                	12
#define CCU80_IN1_CCU80_ST1                	13
#define CCU80_IN1_CCU80_ST2                	14
#define CCU80_IN1_CCU80_ST3                	15
#define CCU80_IN1_CCU81_SR3                	11
#define CCU80_IN1_ERU1_PDOUT0              	9
#define CCU80_IN1_ERU1_PDOUT1              	5
#define CCU80_IN1_P0_7                     	0
#define CCU80_IN1_P0_8                     	1
#define CCU80_IN1_P3_1                     	2
#define CCU80_IN1_POSIF0_OUT2              	3
#define CCU80_IN1_POSIF0_OUT5              	4
#define CCU80_IN1_SCU_ERU1_IOUT1           	6
#define CCU80_IN1_SCU_GSC80                	7
#define CCU80_IN1_VADC0_G0BFL1             	8
#define CCU80_IN2_CCU42_SR3                	10
#define CCU80_IN2_CCU80_ST0                	12
#define CCU80_IN2_CCU80_ST1                	13
#define CCU80_IN2_CCU80_ST2                	14
#define CCU80_IN2_CCU80_ST3                	15
#define CCU80_IN2_CCU81_SR3                	11
#define CCU80_IN2_ERU1_PDOUT0              	9
#define CCU80_IN2_ERU1_PDOUT2              	5
#define CCU80_IN2_P0_6                     	1
#define CCU80_IN2_P0_7                     	0
#define CCU80_IN2_P3_0                     	2
#define CCU80_IN2_POSIF0_OUT2              	3
#define CCU80_IN2_POSIF0_OUT5              	4
#define CCU80_IN2_SCU_ERU1_IOUT2           	6
#define CCU80_IN2_SCU_GSC80                	7
#define CCU80_IN2_VADC0_G0BFL2             	8
#define CCU80_IN3_CCU43_SR3                	10
#define CCU80_IN3_CCU80_ST0                	12
#define CCU80_IN3_CCU80_ST1                	13
#define CCU80_IN3_CCU80_ST2                	14
#define CCU80_IN3_CCU80_ST3                	15
#define CCU80_IN3_CCU81_SR3                	11
#define CCU80_IN3_ERU1_PDOUT0              	9
#define CCU80_IN3_ERU1_PDOUT3              	5
#define CCU80_IN3_P0_7                     	0
#define CCU80_IN3_P3_13                    	2
#define CCU80_IN3_P3_3                     	1
#define CCU80_IN3_POSIF0_OUT2              	3
#define CCU80_IN3_POSIF0_OUT5              	4
#define CCU80_IN3_SCU_ERU1_IOUT3           	6
#define CCU80_IN3_SCU_GSC80                	7
#define CCU80_IN3_VADC0_G0BFL3             	8
#define CCU81_IN0_CCU40_SR3                	10
#define CCU81_IN0_CCU80_SR3                	11
#define CCU81_IN0_CCU81_ST0                	12
#define CCU81_IN0_CCU81_ST1                	13
#define CCU81_IN0_CCU81_ST2                	14
#define CCU81_IN0_CCU81_ST3                	15
#define CCU81_IN0_ERU1_PDOUT0              	5
#define CCU81_IN0_ERU1_PDOUT1              	8
#define CCU81_IN0_P3_0                     	2
#define CCU81_IN0_P5_0                     	0
#define CCU81_IN0_P5_1                     	1
#define CCU81_IN0_POSIF1_OUT2              	3
#define CCU81_IN0_POSIF1_OUT5              	4
#define CCU81_IN0_SCU_ERU1_IOUT0           	6
#define CCU81_IN0_SCU_GSC81                	7
#define CCU81_IN0_VADC0_G0SR3              	9
#define CCU81_IN1_CCU41_SR3                	10
#define CCU81_IN1_CCU80_SR3                	11
#define CCU81_IN1_CCU81_ST0                	12
#define CCU81_IN1_CCU81_ST1                	13
#define CCU81_IN1_CCU81_ST2                	14
#define CCU81_IN1_CCU81_ST3                	15
#define CCU81_IN1_ERU1_PDOUT0              	8
#define CCU81_IN1_P3_13                    	2
#define CCU81_IN1_P5_0                     	0
#define CCU81_IN1_P5_2                     	1
#define CCU81_IN1_POSIF1_OUT2              	3
#define CCU81_IN1_POSIF1_OUT5              	4
#define CCU81_IN1_SCU_ERU1_IOUT1           	6
#define CCU81_IN1_SCU_GSC81                	7
#define CCU81_IN1_VADC0_G1SR3              	9
#define CCU81_IN2_CCU42_SR3                	10
#define CCU81_IN2_CCU80_SR3                	11
#define CCU81_IN2_CCU81_ST0                	12
#define CCU81_IN2_CCU81_ST1                	13
#define CCU81_IN2_CCU81_ST2                	14
#define CCU81_IN2_CCU81_ST3                	15
#define CCU81_IN2_ERU1_PDOUT1              	8
#define CCU81_IN2_ERU1_PDOUT2              	5
#define CCU81_IN2_P3_12                    	2
#define CCU81_IN2_P5_0                     	0
#define CCU81_IN2_P5_3                     	1
#define CCU81_IN2_POSIF1_OUT2              	3
#define CCU81_IN2_POSIF1_OUT5              	4
#define CCU81_IN2_SCU_ERU1_IOUT2           	6
#define CCU81_IN2_SCU_GSC81                	7
#define CCU81_IN2_VADC0_G2SR3              	9
#define CCU81_IN3_CCU43_SR3                	10
#define CCU81_IN3_CCU80_SR3                	11
#define CCU81_IN3_CCU81_ST0                	12
#define CCU81_IN3_CCU81_ST1                	13
#define CCU81_IN3_CCU81_ST2                	14
#define CCU81_IN3_CCU81_ST3                	15
#define CCU81_IN3_ERU1_PDOUT1              	8
#define CCU81_IN3_ERU1_PDOUT3              	5
#define CCU81_IN3_P3_11                    	2
#define CCU81_IN3_P5_0                     	0
#define CCU81_IN3_P5_4                     	1
#define CCU81_IN3_POSIF1_OUT2              	3
#define CCU81_IN3_POSIF1_OUT5              	4
#define CCU81_IN3_SCU_ERU1_IOUT3           	6
#define CCU81_IN3_SCU_GSC81                	7
#define CCU81_IN3_VADC0_G3SR3              	9
#endif


